eisup_2019_docmng_integration/src/Documents/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеБюджетныхАналитик</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяОборотов</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТипКонтрагента</name>
      <type>
        <types>CatalogRef.абс_ТипыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеБиллинговыхУслуг</name>
    <attributes>
      <name>ТипБиллинга</name>
      <type>
        <types>CatalogRef.абс_ТипыБиллинга</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеУслуги</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУслугиБиллинга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>этоМГМН</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПервичныхДокументов/абс_СтатусыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПервичныхДокументов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПринятыБухгалтером</name>
    <comment>Обработка принятых документов (до оптимизации 2018)</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>УточнениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УточнениеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДокумента</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Источник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Приемник</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДиректоромДирекции</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
    <comment>Департамент казначейства</comment>
  </enumValues>
  <enumValues>
    <name>СогласованиеОЭФ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомКЦ</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДД</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Функция ПеременнаяСодержитСвойство(Переменная, ИмяСвойства)
	
	// Инициализируем структуру для теста с ключом (значение переменной "ИмяСвойства") и значением NULL
	СтруктураПроверка = Новый Структура;
	СтруктураПроверка.Вставить(ИмяСвойства, NULL);
	
	// Заполняем созданную структуру из переданного значения переменной
	ЗаполнитьЗначенияСвойств(СтруктураПроверка, Переменная);
	
	// Если значение для свойства структуры осталось NULL, то искомое свойство не найдено, и наоборот.
	Если СтруктураПроверка[ИмяСвойства] = NULL Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТолькоПросмотрВсемЭлементам(мТолькоПросмотр = Истина)

	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Элемент.ТолькоПросмотр = мТолькоПросмотр;
		Исключение
			Элемент.Доступность = Не мТолькоПросмотр;						
		КонецПопытки;
	КонецЦикла;
	Элементы.ФормаДокументttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикамкмдПерейтиСоответствиеБиллинговыхУслуг.Доступность = Истина;
	Элементы.ФормаДокументttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикамкмдПерейтиСоответствиеБюджетныхАналитик.Доступность = Истина;
    Элементы.Ответственный.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоответствиеБюджетныхАналитик(Организация)
	
	СписокСоответствия = Документы.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам.ЗаполнитьСоответствиеБюджетныхАналитик(Организация);
	Объект.СоответствиеБюджетныхАналитик.Загрузить(СписокСоответствия);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоответствиеБиллинговыхУслуг(Организация)
	
	СписокСоответствия = Документы.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам.ЗаполнитьСоответствиеБиллинговыхУслуг(Организация);
	Объект.СоответствиеБиллинговыхУслуг.Загрузить(СписокСоответствия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьДокумента(ТЧ)
	
	ТабличныеЧасти = Новый Соответствие;
	ТабличныеЧасти.Вставить("СоответствиеБюджетныхАналитик", "Соответствие бюджетных аналитик");
	ТабличныеЧасти.Вставить("СоответствиеБиллинговыхУслуг", "Соответствие биллинговых услуг");
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Текст = "Для заполнения табличной части документа необходимо выбрать организацию.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Объект[ТЧ].Количество() > 0 Тогда
		Ответ = Вопрос("Перед заполнением табличная часть документа '" + Строка(ТабличныеЧасти.Получить(ТЧ)) + "' будет очищена. Продолжить?", РежимДиалогаВопрос.ОКОтмена);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТЧ = "СоответствиеБюджетныхАналитик" Тогда	
		ЗаполнитьСоответствиеБюджетныхАналитик(Объект.Организация);
	ИначеЕсли ТЧ = "СоответствиеБиллинговыхУслуг" Тогда
		ЗаполнитьСоответствиеБиллинговыхУслуг(Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыНаСервере()
	
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("Дт", ТекущаяДата());
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("СсылкаНаДокумент", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));	
	
	УстановитьТолькоПросмотрВсемЭлементам();
	Если мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПервичныхДокументов.Подготовка") Тогда
		УстановитьТолькоПросмотрВсемЭлементам(Ложь);
	ИначеЕсли мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПервичныхДокументов.СогласованиеОФК") Тогда
		Если (Не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭФ) = Неопределено Или
				Не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено) Тогда
			УстановитьТолькоПросмотрВсемЭлементам(Ложь);
		КонецЕсли;
	Иначе			
		УстановитьТолькоПросмотрВсемЭлементам(Ложь);
	КонецЕсли;		
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтатусыДокументаНаСервере()

	Документы.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам.ЗаполнитьСписокДоступныхСтатусов(Элементы.мСтатус.СписокВыбора, Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСтатусыДокументаНаСервере();
	мСтатус = Объект.Статус;
	ТекущаяОрганизация = Объект.Организация;
	ОбновитьВидимость();
	Если ЭтоНовый Тогда
		кмдЗаполнить(Элементы.ФормакмдЗаполнить);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = (Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая());	
	УстановитьПараметрыНаСервере();	
	вСтатус = Объект.Статус;	
	
КонецПроцедуры

&НаКлиенте
Процедура мСтатусПриИзменении(Элемент)
	
	Объект.Статус = мСтатус;	
	ЗаполнитьСтатусыДокументаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьВидимость();
	УстановитьПараметрыНаСервере();
	Элементы.ИсторияСогласования.Обновить();
	ЗаполнитьСтатусыДокументаНаСервере();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если вСтатус <> Объект.Статус Тогда
		ПричинаИзмененияСтатуса = "";
		Если ВвестиСтроку(ПричинаИзмененияСтатуса, "Укажите причину изменения статуса.", , Истина) Тогда
			Объект.ПричинаИзмененияСтатуса = ПричинаИзмененияСтатуса;
		Иначе 
			мСтатус = вСтатус;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура кмдЗаполнитьСоответствиеБюджетныхАналитик(Команда)
	
	ЗаполнитьТабличнуюЧастьДокумента("СоответствиеБюджетныхАналитик");
	
КонецПроцедуры

&НаКлиенте
Процедура кмдЗаполнитьСоответствиеБиллинговыхУслуг(Команда)
	
	ЗаполнитьТабличнуюЧастьДокумента("СоответствиеБиллинговыхУслуг");
	
КонецПроцедуры

&НаКлиенте
Процедура кмдЗаполнить(Команда)
	
	ЗаполнитьТабличнуюЧастьДокумента("СоответствиеБюджетныхАналитик");
	ЗаполнитьТабличнуюЧастьДокумента("СоответствиеБиллинговыхУслуг");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ТекущаяОрганизация <> Объект.Организация Тогда
		ЗаполнитьТабличнуюЧастьДокумента("СоответствиеБюджетныхАналитик");
		ЗаполнитьТабличнуюЧастьДокумента("СоответствиеБиллинговыхУслуг");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяОрганизация = Объект.Организация;
	
КонецПроцедуры
